// js/festivalData2026.js

const FES_DATA = [
  {
    floor: "B1階",
    stalls: [
      { name: "START Planet", place: "美術室", group: "美術・アートクラフト部", description: "美術アートクラフト部の惑星「START Planet」へようこそ。この惑星には光り輝く作品がたくさん。とんぼ玉やレジン作品、絵画の販売とサンドブラスト体験を実施しています。ここでしか出会えないきらめきを、ぜひ見つけに来てください。", image: "" },
      { name: "本箱作り体験", place: "レクチャールーム", group: "ものづくり部(建築班)", description: "思い出を詰め込める、自分だけの本箱を作ろう！本箱にはお守りやアクセサリーが入れられます。数に限りがあるのでお早めに！そして去年製作したスマートボールで遊べます。ぜひ体験しに来てください！", image: "" },
      { name: "", place: "ものづくり系活動室①・②", group: "ものづくり部(自動車班)", description: "ものづくり部(自動車班)は地下部活動室にて来月行われる全国大会に向け車両調整中です。エンジン始動の様子なども見学できます。皆様の見学をお待ちしています。", image: "" },
      { name: "体験乗車", place: "正門前", group: "ものづくり部(SL班)", description: "ものづくり部SL班では、本校で製作したミニSLや電気機関車を正門前から100周年記念ホールまでの間を走らせています。SLは本物の1/8の縮尺で製作されていて石炭と水で動く本物の蒸気機関車です。せっかくの機会ですので是非体験乗車をしてみてください。", image: "" },
      { name: "", place: "家庭科室", group: "料理愛好会", description: "今年も料理愛好会は心を込めて自慢の一品を作ります！！おいしさはもちろん、見た目にもこだわった料理をぜひお楽しみください！部員一同、お待ちしています！！", image: "" },
      { name: "キーホルダー製作", place: "レクチャールーム", group: "パソコン部", description: "3Dプリンターを使って自分だけのキーホルダーをつくろう！部活で作ったゲーム等の展示と体験もあるよ！", image: "" }
    ]
  },
  {
    floor: "1階",
    stalls: [
      { name: "日駒祭 ON AIR", place: "放送ブース", group: "放送委員会", description: "放送委員会では、来校者や在校生から募集したリクエスト曲をBGMとして流し、日駒祭を盛り上げます。音楽と放送を通して、皆さんがより楽しく文化祭を過ごせるようサポートします。是非、お気に入りの一曲をリクエストし、日駒祭を一緒に盛り上げましょう！", image: "" },
      { name: "", place: "中学学習室", group: "中学入試相談室", description: "中学入試に関する相談ブースを設けています。不安なこと、気になるときなど、お気軽にご相談ください。お待ちしています。", image: "" },
      { name: "", place: "コミュニケーションラボ", group: "高校入試相談室", description: "学校生活、部活動、入試方法など気になることがあれば、お気軽にお立ち寄りください。本校の教員が熱を持って対応させていただきます。", image: "" },
      { name: "", place: "1A会議室＆110・112・113・114", group: "休憩室", description: "こちらは休憩室です。休憩室のみお食事が可能です。日駒祭が楽しすぎて、少し歩き疲れた方もどうぞ。", image: "" },
      { name: "蜜蝋ハンドクリーム作り", place: "生物室・屋上", group: "園芸養蜂部", description: "ミツバチがつくる蜜蝋をつかってハンドクリームづくりをしませんか？さらに、屋上で行う時間限定のミツバチイベントでは、ハチミツレモンスカッシュをご提供します！ぜひ遊びに来てください。", image: "" },
      { name: "クロスワードパズル", place: "図書館", group: "高校図書委員会", description: "日駒図書館、そして、高校図書委員会の活動を楽しく理解していただける催みを実施。今年度は、館内の蔵書利用すれば解けるクロスワードパズルなどで皆さんをお迎えします。また、日駒祭名物おすすめ本の特集コーナーも設置。皆さんを、“奥深い”本の世界へ招待します。ぜひお立ち寄りください。", image: "" },
      { name: "FULL GALAXY", place: "化学室", group: "サイエンス部(科学技術班)", description: "普通とはちょっと違うスライムを作る体験ができます！色が変わったり…暗闇で光ったり…あなただけのオリジナルスライムを作ってみませんか？他にも1時間ごとに液体窒素を使った実験ショーも行っています！", image: "" },
      { name: "食品販売", place: "エレベーターホール", group: "後援会・東工会", description: "1階エレベーターホールにて、後援会・東工会による食品販売を行っております。カレー、フランクフルト、お飲み物など、メニュー盛りだくさんでお待ちしております。お食事は休憩室でどうぞ。", image: "" }
    ]
  },
  {
    floor: "2階",
    stalls: [
      { name: "日駒美術館", place: "201・202・203・204", group: "J1", description: "皆様、ようこそお越しくださいました。ここは日駒美術館です。この美術館では皆様に日駒について知ってもらえるような様々な展示品が展示されています。それでは日駒美術館や作品をどうぞ思う存分お楽しみください！", image: "" },
      { name: "作品展示", place: "205", group: "模型鉄道研究部(模型班)", description: "部員の作品を展示しています。航空機、戦車などのスケールモデルやガンプラなどのキャラクタープラモデルをはじめとした様々な作品が揃っております。パーツが付いている枠である「ランナー」を使ったキーホルダーをデコレーションする体験もできます。作ったキーホルダーはお持ち帰りいただけます。", image: "" },
      { name: "", place: "206", group: "模型鉄道研究部(鉄道研究班)", description: "こんにちは。鉄道研究班です。自分たちで製作し大会に出展した作品の展示や鉄道模型の走行展示・体験運転などを行っています！また運転シミュレータも実施します。老若男女歓迎ですのでお気軽にお越しください！！", image: "" },
      { name: "写真展", place: "207", group: "写真部", description: "写真部では、部員が心を込めて撮影した風景や動物、日常の一瞬を展示しています。それぞれの作品に込められた思いや個性をぜひご覧ください。お気に入りの一枚を見つけに、ぜひお立ち寄りください！", image: "" },
      { name: "ちはやふるの世界を体験しよう", place: "208", group: "競技かるた部", description: "競技かるた部は今年で活動が最後になります。私たちは、札ができるだけ遠くにとばし札と五色かるたを行います。百人一首を覚えていなくても手だけあればできるゲームなので、気軽に来てください！笑い合い、競い合い、たくさんの思い出を重ねてきた私たちの集大成です！！最後の一戦、最後の一札まで、みんなで心に残るひとときを楽しんでください。", image: "" },
      { name: "日駒世界一周旅行", place: "209・210・211", group: "J2", description: "世界の国々の伝統や文化などについてまとめたポスター発表や、世界の幾つかの有名な建造物を象った模型を作成して展示をしています！スタンプラリーや体験コーナーも用意しているので、ぜひ日駒で世界一周旅行をたのしんでいってください。", image: "" },
      { name: "ボドゲの空", place: "212", group: "ボードゲーム部", description: "ボードゲームで遊んでいきませんか？初心者も経験者も大歓迎。将棋やオセロなどから少しマニアックなものまであります。人数が足りなくても部員が入るのでご安心ください。丁寧なルール説明もありますので遊びに来てください。", image: "" },
      { name: "", place: "213", group: "マンガ研究部", description: "お絵かきコーナーや漫研くじを今年も開催いたします。部員の漫画プレゼンを見て、気になる作品を読みこむことができるコーナーもあります。様々なジャンルの作品に触れ、趣味が広がる楽しさをぜひ知ってもらいたいです。", image: "" },
      { name: "", place: "215", group: "歴史研究会", description: "様々な時代が好きな歴史好き達が、歴史についての事実に基づく考察や歴史のニュースを書いたポスターと自分たちで作った映像を展示しています。小中学生もわかるように作ってますので歴史に興味がある人は気軽にいらしてください。", image: "" },
      { name: "", place: "216", group: "ベビールーム", description: "乳幼児と、乳幼児をお連れの保護者のみなさまにご利用頂けます。おむつ交換台もございます。", image: "" },
      { name: "", place: "217", group: "授乳室", description: "赤ちゃんと、赤ちゃんをお連れの女性のみご利用頂けます。おむつ交換台もございます。", image: "" }
    ]
  },
  {
    floor: "3階",
    stalls: [
      { name: "和風喫茶", place: "100周年記念ホール2階和室", group: "茶道部", description: "表千家不審庵のお点前でお茶様をお迎えします。「和風喫茶」は、椅子に座ってお抹茶とお菓子を召し上がって頂くお札のお茶席です。茶道体験で一服、ぜひ和室にくつろぎの時間をお過ごし下さい。※100周年記念ホールへの移動の際は、1階の裏階段を2階まで昇るか、3階スチューデントホールから2階に降りてください。", image: "" },
      { name: "行くなって言ったじゃん…", place: "301", group: "J3A", description: "行くなって言ったじゃん…どうしていっちゃったの？ここから先は…気をつけてね…※このお化け屋敷はフィクションです？絶叫館よりも怖い可能性がございます…そこはご注意ください？？", image: "" },
      { name: "イン B・ジョーンズ", place: "302", group: "J3B", description: "イン B・ジョーンズの世界へようこそ！黄金都市の古代遺跡に隠された謎を解き明かし、宝を手に入れろ！あなたはトラップを解き明かしながら、館からの脱出を目指します。陽気な使用人？友達と一緒に謎解きゲームに挑戦しませんか？お待ちしています！", image: "" },
      { name: "Aoi Casino", place: "303", group: "J3C", description: "裏路地の先にひっそりと佇む、誰も存在を知らないカジノ。そこは組織の者だけが出入りを許される場所。あなたは極秘任務として潜入する。しかし扉を開けた瞬間から、任務は静かに狂い始める。見張られているつもりだった…だが、本当に監視されていたのは誰だ。", image: "" },
      { name: "かぜの館", place: "304", group: "J3D", description: "お化け屋敷×謎解き×迷路！森の中にある「かぜの館」に迷い込んだあなた……。この館のなかで起きた不可解な事件を解き明かしながら、館からの脱出を目指し。陽気な使用人？友人や家族と一緒にスリル満点のコーヒーカップを楽しんで、ここでしか作れない最高の思い出を作ろう！", image: "" },
      { name: "ナツメガス natsukoma〜", place: "305", group: "J3E", description: "ようこそ「ナツメガス natsukoma」へ。きらびやかな光に包まれた、ラスベガスのような夢の世界！しかし、その一歩先にはいきのむような心理戦が待っている……。勝負を決めるのは運か、それとも冷静な判断か。仲間に挑み、勝利をつかみ取れ。このスリル、一度味わえば忘れられない。natsukoma nichikomaで、最高の勝負を体験しよう。", image: "" },
      { name: "〜それでも日駒は回っている〜", place: "306", group: "J3F", description: "広大に広がる宇宙の世界へようこそ。教室の中にある惑星(コーヒーカップ)に乗って特別な宇宙気分を満喫しませんか？友人や家族と一緒にスリル満点のコーヒーカップを楽しんで、ここでしか作れない最高の思い出を作ろう！", image: "" },
      { name: "逃げ出せ！ カシムラの森", place: "307", group: "J3G", description: "ここは、深い霧が辺りを包み込む「カシムラの森」。この不気味な森は、本年来る者も入ることのないような場所ですが…。どうやら不審なアナタは足を踏み入れてしまったようです。果たしてアナタは、この森から脱出することができるのか、、、、不気味で不思議な「カシムラの森」に、ぜひ迷い込んでみてはいかがですか？", image: "" },
      { name: "発見！街角フランス語", place: "308", group: "フランス語愛好会", description: "街中には、フランス語がたくさん！職場の街でよくも見かける！そんなフランス語を探してきました。街の中のフランス語を発見して紹介します。また、日本語に混在しているフランス語や簡単な表現を紹介します。是非、日駒のフランス語空間へ！", image: "" },
      { name: "ゴルフ体験コーナー", place: "312", group: "ゴルフ部", description: "おっ、ゴルフ部やってるじゃん！パターで狙ってカップインを目指そう！ネットに向かってショット体験もできるので、初心者も経験者も大歓迎。ぜひ気軽にお立ち寄りください。たくさんのご来場をお待ちしています！！！", image: "" },
      { name: "ストラックアウト", place: "313", group: "硬式テニス部", description: "硬式テニス部では、実際に使うラケットとボールで、普段校内で実施している練習を体験できます。ターゲットを狙う難しさを感じつつ、ボールを打つ楽しさを体験してください！また、近年世界的に注目されているピックルボールにも触れられるかも！", image: "" },
      { name: "Hit a target", place: "315", group: "バドミントン部", description: "バドミントンのラケットとシャトルを使った的当てゲーム！たくさんの標的に当てて、景品をゲットしてね！初心者さんでも大歓迎！是非気軽にチャレンジしに来てください！部員一同待ってます！", image: "" },
      { name: "屋上レンズ", place: "316", group: "映画愛好会", description: "映画愛好会では、高校生の日常をテーマにして学生の今だからこそ作れるような超短編の映画を作ってみました！撮影や脚本はとても大変でしたが、出演してくれた方など皆さんのご協力もあって作り上げることができました。是非一度足を運んでいただけると嬉しいです！", image: "" },
      { name: "", place: "317", group: "サイエンス部(天文宇宙班)", description: "部員がプラネタリウムの解説に挑戦！季節の星座や宇宙の不思議を、生徒ならではの視点でわかりやすくご案内します。満天の星空を眺めながら、宇宙の魅力をぜひ体感してください。", image: "" },
      { name: "後援会バザー", place: "スチューデントホール", group: "後援会", description: "スチューデントホールにて後援会バザーを行っています。あれもこれもこんなお値段で…！？スッキリ掘り出し物に出会えるかも…！？どうぞ宝探しの気分でお越し下さい。※スチューデントホールへお越しの際は、3階店連絡通路部が近くて便利です。", image: "" },
      { name: "制服リサイクル", place: "310", group: "後援会", description: "310教室にて制服リサイクル販売を行っています。あれもこれもこんなお値段で…！？スッキリ掘り出し物に出会えるかも…！？どうぞ宝探しの気分でお越し下さい。", image: "" },
      { name: "同窓会喫茶", place: "319", group: "東工日駒同窓会", description: "同窓会では、「恩師や師との語らいの場」、「お休み処」として喫茶室をオープンしています。是非お立ち寄りくださいませ。", image: "image/cafe1.jpg" }
    ]
  },
  {
    floor: "4階",
    stalls: [
      { name: "クライミング＆テント体験", place: "401", group: "山岳部", description: "私たち山岳部は、今年度もクライミングのボードを作成、初心者にもやさしいボルダー体験を行います！！皆さん「お待ちしています！」", image: "" },
      { name: "ストラックアウト", place: "402", group: "軟式庭球部", description: "軟式庭球部ストラックアウトでは実際に普段使用しているラケットを使って、ボールを打ってもらい的に当てたポイントで景品がもらえる企画を毎年行っています。軟式庭球部は何年も続いている伝統ある部活です。中学3年生・高校1年生が中心となり一年生準備しました。是非プレイしに来てください。", image: "" },
      { name: "水泳部からの挑戦状！", place: "403", group: "水泳部", description: "大変だ！大会でとったトロフィーを更衣室に置いてきてしまった！部員の代わりに、仕掛けられた謎を解き明かしながら迷路を進んで無事にトロフィーを見つけ出そう！部活の紹介ブースもあります！", image: "" },
      { name: "〜君たちから温べ〜何でも卓球！！", place: "404", group: "卓球部", description: "基本卓球部員と卓球対決ですが、挑戦者側が選んだもので卓球部員は戦います！ラケットを選んで部員と真剣勝負もできます！勝って景品をゲットしよう！卓球経験者から未経験の方も楽しめます、ぜひ来てください！", image: "" },
      { name: "雪山山荘", place: "405", group: "スキー部", description: "雪山にたたずむ小さな別荘。寒さで凍えそうな体を優しく温めてくれる幸せなひと時をお過ごし下さい。", image: "" },
      { name: "アーチェリー体験", place: "406", group: "アーチェリー部", description: "普段部員が使用している弓で近距離体験が出来ます。部員が丁寧にサポートするので安心して楽しめます。得点に応じて貰える景品が変わります。高得点を目指して景品をゲットしよう！！", image: "" },
      { name: "T・ストーリー", place: "407", group: "2T", description: "【人間が帰る前に部屋から脱出せよ！】ここは夜中に動き出すおもちゃたちの秘密の世界。もうすぐ人が帰ってくる！？おもちゃになりきり、隠された「知力・体力・時の運」の試練をクリアして脱出せよ！君はこの部屋から抜け出せるか？", image: "" },
      { name: "えむり〜ぐ", place: "408", group: "2M", description: "私たちのクラスでは、あの大人気クイズ番組のような空間を作りました。まるで、テレビの中に入ったような世界観が魅力となっています。是非、挑戦して高得点を目指してみてください！", image: "" },
      { name: "ホラー系脱出ゲーム", place: "409", group: "2L", description: "ただ驚くだけの学校のお化け屋敷に飽きていませんか？私達2年L組がお届けするのは「体験型脱出ゲーム」です！様々なゲームをクリアして無事に神社から脱出できるのか！？みなさんの挑戦をお待ちしています！！", image: "" },
      { name: "サバイバルゲーム", place: "410", group: "2H", description: "迷路を駆け抜け、敵を倒して勝利をつかめ！仲間との連携と作戦が勝敗を左右する、本気のチームバトル。伏撃、待ち伏せ、挟み撃ちなど戦い方は自由！最後まで気が抜けないスリルと興奮を味わおう。この日限りの最強バトルに挑戦しよう。", image: "" },
      { name: "最後の幸動者〜あなたは無事に出られますか〜", place: "412", group: "2G", description: "今年の夏、最高にスリル満点のお化け屋敷がオープン！暗闇の中に潜む恐怖、張り詰めた空気感。私たちのクラスが作り上げた渾身の恐怖体験をぜひ味わいに来てください。皆さんの挑戦をお待ちしています。", image: "" },
      { name: "Arena of DARTS", place: "413", group: "5A", description: "みなさんはダーツをどれだけ知っていますか？持ち方、立ち方、投げ方、どうでしょう。ルールはい組いくつ知っていますか？基本的な3つのゲームを紹介します。初めてでもプロ級の腕前でも、どうぞ遊びにきてください。", image: "" },
      { name: "監獄脱出ゲーム〜闇のサーカス団からの脱出〜", place: "414", group: "5B", description: "謎のサーカス団から挑戦状！制限時間は5分、仲間と力を合わせてすべての謎を解き明かせ！", image: "" },
      { name: "義異荘(5C荘)", place: "415", group: "5C", description: "観光地として賑わっていた旅館「霧（ごう）義（し）荘（そう）」。ある日、数人の従業員が忽然と姿を消し、その後も不可解な出来事や失踪が相次いだ。やがて旅館は解体され、誰しもが終わったと思っていたが……「従業員一同、次の来場者を心よりお待ちしております……」", image: "" },
      { name: "扉の向こうの3つの鍵", place: "416", group: "5D", description: "3つの「扉」の向こうに待ち受けるは3つの「試練」。君はすべての「試練」を解き明かし、制限時間内に脱出できるか？何度も挑戦し、完全制覇を目指せ！", image: "" },
      { name: "ドキドキ SEの鏡パラダイス", place: "417", group: "5E", description: "乗り物に乗ってドキドキのジャングル探検に出かけよう！珍しい動物たちがいっぱいでとっても楽しい！……はずだったけど……あれ、なんだか様子が、、おかしい、、かも？", image: "" }
    ]
  }
];
